---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationPartJustification
source: html/5c6c9daf-4547-01f1-9ba8-39a970ca9e68.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartJustification

Fabrication part eccentric justifications for alignment for flat edged parts.

## Syntax (C#)
```csharp
public enum FabricationPartJustification
```